src/test/jmeter/as400_opcosus_perf.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="4.0" jmeter="4.0 r1823414">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="res06" elementType="Argument">
            <stringProp name="Argument.name">res06</stringProp>
            <stringProp name="Argument.value">/opt/perf-test-data/opcosusas400/res06.csv</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="data" elementType="Argument">
            <stringProp name="Argument.name">data</stringProp>
            <stringProp name="Argument.value">${__P(load.test.iterations,/opt/perf-test-data/opcosusas400/)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="res07" elementType="Argument">
            <stringProp name="Argument.name">res07</stringProp>
            <stringProp name="Argument.value">/opt/perf-test-data/opcosusas400/res07.csv</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="res08" elementType="Argument">
            <stringProp name="Argument.name">res08</stringProp>
            <stringProp name="Argument.value">/opt/perf-test-data/opcosusas400/res08.csv</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rampUp" elementType="Argument">
            <stringProp name="Argument.name">rampUp</stringProp>
            <stringProp name="Argument.value">${__P(rampUp,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="threadCount" elementType="Argument">
            <stringProp name="Argument.name">threadCount</stringProp>
            <stringProp name="Argument.value">${__P(threadCount,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="loopCount" elementType="Argument">
            <stringProp name="Argument.name">loopCount</stringProp>
            <stringProp name="Argument.value">${__P(loopCount,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${loopCount}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${threadCount}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampUp}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="false">
          <stringProp name="filename">E:\apache-jmeter-4.0\AS400\datafile.csv</stringProp>
          <stringProp name="variableNames">UserName,Password,SupplierId,ClientId,ItemName</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="false">
          <stringProp name="filename">E:\apache-jmeter-4.0\AS400\S06.csv</stringProp>
          <stringProp name="variableNames">P_UserName,P_Password,P_Buyer,P_Vendor,P_Item,P_Vend2</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="S06" enabled="true">
          <stringProp name="filename">${data}S06.csv</stringProp>
          <stringProp name="variableNames">P6_UserName,P6_Password,P6_Buyer,P6_Vendor,P6_Item,P6_Vend2</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="S07" enabled="true">
          <stringProp name="filename">${data}S07.csv</stringProp>
          <stringProp name="variableNames">P7_UserName,P7_Password,P7_CustNo,P7_ItemNo,P7_Qty</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="S08" enabled="true">
          <stringProp name="filename">${data}S08.csv</stringProp>
          <stringProp name="variableNames">P8_UserName,P8_Password,P8_CustNo,P8_ItemNo,P8_Qty</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="S06_SUS_PO_Creation" enabled="true">
          <stringProp name="BeanShellSampler.query">import com.syscolabs.tn5250.functions.TerminalDriverTestIntegration;
TerminalDriverTestIntegration test=new TerminalDriverTestIntegration();
//test.setup();
String pResponseTime=test.S06_SUS_PO_CreationWP(&quot;as242k&quot;,&quot;${P6_UserName}&quot;,&quot;${P6_Password}&quot;,&quot;${P6_Buyer}&quot;,&quot;${P6_Vendor}&quot;,&quot;${P6_Item}&quot;,&quot;${P6_Vend2}&quot;,&quot;6&quot;,&quot;10&quot;,&quot;18&quot;);
vars.put(&quot;resS06_SUS_PO_Creation&quot;,pResponseTime);


</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="false">
          <stringProp name="BeanShellSampler.query">import org.apache.jmeter.protocol.http.control.CookieManager;
import com.syscolabs.tn5250.functions.TerminalDriverTestIntegration;

TerminalDriverTestIntegration test =new TerminalDriverTestIntegration();
String pResponseTime=test.S06_SUS_PO_CreationWP(&quot;AS242K&quot;,&quot;${P_UserName}&quot;,&quot;${P_Password}&quot;,&quot;${P_Buyer}&quot;,&quot;${P_Vendor}&quot;,&quot;${P_Item}&quot;,&quot;${P_Vend2}&quot;);</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="false">
          <stringProp name="BeanShellSampler.query">import com.syscolabs.tn5250.functions.TerminalDriverTestIntegration;
TerminalDriverTestIntegration test =new TerminalDriverTestIntegration();
String pResponseTime=test.should_connect_with_pub1(&quot;AS242G&quot;,&quot;23&quot;,&quot;${UserName}&quot;,&quot;${Password}&quot;,&quot;${ClientId}&quot;);
vars.put(&quot;responsetime&quot;,pResponseTime);


</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="S07_SUS_SO_creation" enabled="true">
          <stringProp name="BeanShellSampler.query">import com.syscolabs.tn5250.functions.TerminalDriverTestIntegration;
TerminalDriverTestIntegration test =new TerminalDriverTestIntegration();
String pResponseTime=test.S07_SUS_SO_creationWP(&quot;as242k&quot;,&quot;${P7_UserName}&quot;,&quot;${P7_Password}&quot;,&quot;${P7_CustNo}&quot;,&quot;${P7_ItemNo}&quot;,&quot;${P7_Qty}&quot;);
vars.put(&quot;resS07_SUS_SO_creation&quot;,pResponseTime);


</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="false">
          <stringProp name="BeanShellSampler.query"> import java.io.*;
 
 String filename= vars.get(&quot;val&quot;);
 FileWriter fw = new FileWriter(filename,true); //the true will append the new data
 fw.write(vars.get(&quot;resSUS_PO_Creation&quot;));//appends the string to the file
 fw.close();
</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="false">
          <stringProp name="BeanShellSampler.query"> import java.io.*;
 
 String filename= vars.get(&quot;val&quot;);
 FileWriter fw = new FileWriter(filename,true); //the true will append the new data
 fw.write(vars.get(&quot;resS07_SUS_SO_creation&quot;));//appends the string to the file
 fw.close();
</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="S08_SUS_Immediate_SO_creation" enabled="true">
          <stringProp name="BeanShellSampler.query">import com.syscolabs.tn5250.functions.TerminalDriverTestIntegration;
TerminalDriverTestIntegration test =new TerminalDriverTestIntegration();
String pResponseTime=test.S08_SUS_Immediate_SO_creationWP(&quot;as242k&quot;,&quot;${P8_UserName}&quot;,&quot;${P8_Password}&quot;,&quot;${P8_CustNo}&quot;,&quot;${P8_ItemNo}&quot;,&quot;${P8_Qty}&quot;);
vars.put(&quot;resS08_SUS_Immediate_SO_creation&quot;,pResponseTime);


</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="true">
          <stringProp name="BeanShellSampler.query"> import java.io.*;
 
 String filename= vars.get(&quot;res08&quot;);
 FileWriter fw = new FileWriter(filename,true); //the true will append the new data
 fw.write(vars.get(&quot;resS08_SUS_Immediate_SO_creation&quot;));//appends the string to the file
 fw.close();
 String filename= vars.get(&quot;res07&quot;);
 FileWriter fw = new FileWriter(filename,true); //the true will append the new data
 fw.write(vars.get(&quot;resS07_SUS_SO_creation&quot;));//appends the string to the file
 fw.close();
  String filename= vars.get(&quot;res06&quot;);
 FileWriter fw = new FileWriter(filename,true); //the true will append the new data
 fw.write(vars.get(&quot;resS06_SUS_PO_Creation&quot;));//appends the string to the file
 fw.close();</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">E:\apache-jmeter-4.0\test.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>